adpyke.codesnap
eamodio.gitlens
fabiospampinato.vscode-highlight
golang.go
JuanBlanco.solidity
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
rust-lang.rust-analyzer
sainnhe.gruvbox-material
serayuzgur.crates
tamasfe.even-better-toml
usernamehw.errorlens
xabikos.JavaScriptSnippets
zhuangtongfa.material-theme
zxh404.vscode-proto3