tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "kdash-rs/kdash"

# Binaries
brew "git"
brew "zsh"
brew "tmux"
brew "neovim"
brew "wget"
brew "curl"
brew "hub"
brew "gh"
brew "bat"
brew "eza"
brew "peco"
brew "kdash"
brew "gnupg"
brew "pinentry-mac"
brew "thefuck"
brew "kubectx"
brew "go"
brew "node"
brew "yarn"
brew "sccache"
brew "fzf"
brew "ripgrep"
brew "zoxide"
brew "starship"
brew "jq"
brew "yq"
brew "stow"

# Casks
cask "alacritty"
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "discord"
cask "rectangle"
cask "google-cloud-sdk"
cask "font-meslo-lg-nerd-font"

# Mac App Store (optional, need mas-cli installed via brew first if used often)
# brew "mas"
